<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="CtCategoryRseTelecom">RSE Telecom &amp; ICT</string>
    </stringTable>
  </resources>
</policyDefinitionResources>